Sorry for late reply.
I can reproduce the error.

```
Dockerfile
terraform/
  main.tf
```

terraform/main.tf

<details>

```tf
resource "aws_ecr_repository" "this" {
  name = var.function_name
}

resource "docker_registry_image" "app" {
  name = local.ecr_image

  build {
    context = "../"
  }
}

provider "aws" {
  region = var.region

  # Make it faster by skipping something
  skip_get_ec2_platforms  = true
  skip_metadata_api_check = true
}

provider "docker" {
  registry_auth {
    address  = local.ecr_address
    username = data.aws_ecr_authorization_token.token.user_name
    password = data.aws_ecr_authorization_token.token.password
  }
}

variable "function_name" {
  type    = string
  default = "ivy-bot-terraform"
}

variable "region" {
  type    = string
  default = "us-east-1"
}

variable "image_tag" {
  type    = string
  default = "latest"
}

data "aws_caller_identity" "this" {}
data "aws_region" "current" {
  name = var.region
}
data "aws_ecr_authorization_token" "token" {}

locals {
  ecr_address = format("%v.dkr.ecr.%v.amazonaws.com", data.aws_caller_identity.this.account_id, var.region)
  ecr_image   = format("%v/%v:%v", local.ecr_address, aws_ecr_repository.this.id, var.image_tag)
}

terraform {
  required_version = ">= 0.12.6"

  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = ">= 3.27"
    }

    docker = {
      source  = "kreuzwerker/docker"
      version = ">= 2.11"
    }
  }
}
```

</details>

Dockerfile

```dockerfile
FROM alpine:3.13.0
```

```
$ terraform version
Terraform v0.14.6
+ provider registry.terraform.io/hashicorp/aws v3.29.1
+ provider registry.terraform.io/kreuzwerker/docker v2.11.0
```

```
$ terraform apply      

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ivy-bot-terraform"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
    }

  # docker_registry_image.app will be created
  + resource "docker_registry_image" "app" {
      + id            = (known after apply)
      + keep_remotely = false
      + name          = (known after apply)
      + sha256_digest = (known after apply)

      + build {
          + context    = "../:05537388b89370a6f54dc220102783a824e634220e024be405d7a3a227f2253f"
          + dockerfile = "Dockerfile"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_ecr_repository.this: Creating...
aws_ecr_repository.this: Creation complete after 4s [id=ivy-bot-terraform]

Error: Provider produced inconsistent final plan

When expanding the plan for docker_registry_image.app to include new values
learned so far during apply, provider
"registry.terraform.io/kreuzwerker/docker" produced an invalid new value for
.build[0].context: was
cty.StringVal("../:05537388b89370a6f54dc220102783a824e634220e024be405d7a3a227f2253f"),
but now
cty.StringVal("../:eb4129fef72485039e6afe074a5d1a38b639fafe0421bb90375d75491ef638e7").

This is a bug in the provider, which should be reported in the provider's own
issue tracker.
```